In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.set_option('display.max_rows',100)

# 2008-2011

In [29]:
columns = ['LA_code','LA','households','homeless_acc','homeless_pm','TA','TA_pm','no_accom','year']

In [141]:
data1 = []
for x in range(9,12):
    print(x)
    df = pd.read_excel('homelessness/Table_784_2017_18.xlsx',sheet_name=x,header=11)
    df_trim = df[['Local Authority area','estimate)','Total','h/holds','Accommodation)','h/holds.1']].copy()
    df_trim['ONS Code'] = df[df.columns[0]]
    df_trim.insert(0,'ONS Code',df_trim.pop('ONS Code'))
    df_trim['no_accom'] = df[df.columns[-1]]
    df_trim['year'] = 2020 - x
    df_trim = df_trim[~df_trim.loc[:,'ONS Code'].isnull()]
    df_trim.reset_index(drop=True,inplace=True)
    for y in df_trim.index:
        if not df_trim.loc[y,'ONS Code'].startswith('E0'):
            df_trim.drop(y,inplace=True)
    df_trim.reset_index(drop=True,inplace=True)
    for k in df_trim.values.tolist():
        data1.append(k)

9
10
11

In [142]:
df1 = pd.DataFrame(data1)
df1.columns = columns

In [143]:
df1.head()

,LA_code,LA,households,homeless_acc,homeless_pm,TA,TA_pm,no_accom,year
0,E06000005,Darlington,44.0,14.0,0.318182,4.0,0.090909,0.0,2011
1,E06000047,County Durham,216.0,381.0,1.763889,30.0,0.138889,0.0,2011
2,E06000001,Hartlepool,39.0,15.0,0.384615,2.0,0.051282,0.0,2011
3,E06000002,Middlesbrough,58.0,79.0,1.362069,17.0,0.293103,0.0,2011
4,E06000048,Northumberland,136.0,189.0,1.389706,13.0,0.095588,0.0,2011

# 2011-2012

In [144]:
df = pd.read_excel('homelessness/Table_784_2017_18.xlsx',sheet_name=8,header=11)
df = df[['Unnamed: 0','Unnamed: 1','estimate)','Total','h/holds','Accommodation)','h/holds.1',' March 2012']]
df['year'] = 2012
df.columns = columns
df = df[~df.loc[:,'LA_code'].isnull()]
df.reset_index(drop=True,inplace=True)
for x in df.index:
    if not df.loc[x,'LA_code'].startswith('E0'):
        df.drop(x,inplace=True)
df.reset_index(drop=True,inplace=True)
df2 = df.copy()

In [145]:
df2.head()

,LA_code,LA,households,homeless_acc,homeless_pm,TA,TA_pm,no_accom,year
0,E06000047,County Durham,216,425,1.97,25.0,0.12,113,2012
1,E06000005,Darlington,44,15,0.34,0.0,0.00,0,2012
2,E06000001,Hartlepool,39,19,0.49,0.0,0.00,6,2012
3,E06000002,Middlesbrough,58,87,1.50,14.0,0.24,22,2012
4,E06000048,Northumberland,136,229,1.68,16.0,0.12,126,2012

# 2012-13

In [146]:
df = pd.read_excel('homelessness/Table_784_2017_18.xlsx',sheet_name=7,header=11)
df = df[['Unnamed: 0','Unnamed: 1','(000s)','Total','h/holds','Accommodation)','h/holds.1',' March 2013']]
df['year'] = 2013
df.columns = columns
df = df[~df.loc[:,'LA_code'].isnull()]
df['LA_code'] = df['LA_code'].astype('string')
df.reset_index(drop=True,inplace=True)
for x in df.index:
    if not df.loc[x,'LA_code'].startswith('E0'):
        df.drop(x,inplace=True)
df.reset_index(drop=True,inplace=True)
df3 = df.copy()

# 2013-2018

In [147]:
data2 = []
for x in range(2,7):
    df = pd.read_excel('homelessness/Table_784_2017_18.xlsx',sheet_name=x,header=5)
    for i in df.columns:
        if i.startswith('Number of'):
            df = df[['ONS code','Local Authority / Region / Country',i,'Total','Number per 1,000 households',
            'Total in temporary accommodation','Number per 1,000 households.1']]
    df['no_accom'] = df[df.columns[-1]]
    df['year'] = 2020 - x
    df.columns = columns
    df['LA_code'] = df['LA_code'].astype('string')
    df = df[~df.loc[:,'LA_code'].isnull()]
    df.reset_index(drop=True,inplace=True)
    for y in df.index:
        if not df.loc[y,'LA_code'].startswith('E0'):
            df.drop(y,inplace=True)
    df.reset_index(drop=True,inplace=True)
    for a in df.values.tolist():
        data2.append(a)

In [148]:
df4 = pd.DataFrame(data2)
df4.columns= columns
df4.head()

,LA_code,LA,households,homeless_acc,homeless_pm,TA,TA_pm,no_accom,year
0,E07000223,Adur,28.527,38,1.33,62,2.17,2.17,2018
1,E07000026,Allerdale,43.175,22,0.51,6,0.14,0.14,2018
2,E07000032,Amber Valley,54.937,76,1.38,12,0.22,0.22,2018
3,E07000224,Arun,71.369,204,2.86,128,1.79,1.79,2018
4,E07000170,Ashfield,54.054,123,2.28,22,0.41,0.41,2018

In [149]:
df4 = df4.replace('-',np.nan)

In [162]:
df_main = pd.concat([df1,df2,df3,df4])

In [163]:
df_main.reset_index(drop=True,inplace=True)
df_main.sort_values(['year','LA_code'],inplace=True)

In [166]:
df_main.loc[:,'date'] = pd.to_datetime(df_main.loc[:,'year'].astype('str'), format='%Y')

In [168]:
df_main.reset_index(drop=True,inplace=True)

In [170]:
df_main.to_excel('cleaned datasets/Homelessness 2009-2018 by LA.xlsx',index=False)